Janechel/test1/PrimaryMemoryTable/C/STM32F103C8T6/Example/User/main.c
#include "stm32f10x.h"
#include "platform_config.h"
#include "servo.h"
#include "stm32f10x_usart.h"
#include <stdio.h>

//调试变量定义
#define PING_TEST 0   			//PING指令测试
#define READ_TEST 0					// 读取舵机数据测试
#define WRITE_TEST 0				// 写入舵机数据测试
#define SYNC_WRITE_TEST 0			// 同步写测试
#define FACTORY_RESET_TEST 0		// 恢复出厂设置测试
#define PARAMETER_RESET_TEST 0	    // 参数重置测试
#define CALIBRATION_TEST 0			// 校正偏移值测试
#define REBOOT_TEST 0				// 重启测试
#define MODIFY_ID 0                 // 修改舵机ID测试
#define MODIFY_UNKNOWN_ID 0         // 修改未知ID舵机ID测试

//数据接收
uint8_t receive_data[20];
uint8_t receive_len;
uint8_t ret;

extern __IO uint32_t TimingDelay;

void RCC_Configuration(void);
void GPIO_Configuration(void);
void USART1_Init(void);
void USART2_Init(void);
void USART1_Send(uint8_t *data, uint8_t data_len);
void SysTick_Configuration(void);
void Delay(__IO uint32_t nTime);

//重定向printf
int fputc(int ch, FILE *f)
{
  USART_SendData(USART2, (uint8_t) ch);

  while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET)
  {}
		
	return ch;
}

int main(void)
{
	//串口发送数据以及长度
	uint8_t order_buffer[20];
	uint8_t order_len;
	
	//解析应答包得到的数据
	uint16_t analysis_data;
	
	//系统配置
	SysTick_Configuration();
	
	//RCC时钟配置
	RCC_Configuration();
	
	//GPIO配置
	GPIO_Configuration();
	
	//与舵机通信串口初始化
	USART1_Init();
	
	//信息打印串口初始化
	USART2_Init();
	
	struct servo_sync_parameter servo;
	
	servo.id_counts = 2;            //同步写两个舵机
  servo.id[0] = 1;                //第一个舵机id为1
  servo.id[1] = 2;                //第二个舵机id为2
	
  while (1)
  {
#if FACTORY_RESET_TEST
		//恢复出厂设置
    servo_factory_reset(1, order_buffer,&order_len);

    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_factory_reset_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("FACTORY RESET success");
		Delay(1000);
#endif			
		
#if PARAMETER_RESET_TEST
		//参数重置
    servo_parameter_reset(1, order_buffer,&order_len);

    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_parameter_reset_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("PARAMETER RESET SUCCESS");
		Delay(1000);
#endif			

#if CALIBRATION_TEST
		//校正偏移值
    servo_calibration(1, order_buffer,&order_len);

    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
		
    ret = servo_calibration_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("CALIBRATION SUCCESS");
		Delay(1000);
#endif				
		
#if REBOOT_TEST
		//ID1舵机重启
    servo_reboot(1, order_buffer,&order_len);

    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    PRINTF("The servo reboot");
		
		Delay(1000);
#endif			

#if MODIFY_ID
		//将ID为1的舵机修改为ID2
    servo_modify_known_id(1, 2, order_buffer,&order_len);

    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

		PRINTF("modify id success");
		Delay(1000);
#endif

#if MODIFY_UNKNOWN_ID
		//将未知舵机的ID修改为2
    servo_modify_unknown_id(2, order_buffer,&order_len);

    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

		PRINTF("modify id success");
		Delay(1000);
#endif

#if PING_TEST
		//生成指令
    servo_ping(1, order_buffer,&order_len);
    
		//串口发送
		USART1_Send(order_buffer, order_len);
		
		//使能中断接收数据
		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		
		//接收数据清零
		receive_len = 0x00;
		Delay(10);
		
		//关闭接收中断
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
		
		//解析接收到的数据
    ret = servo_ping_analysis(receive_data, &analysis_data);
    if(ret == SUCCESS)
			PRINTF("The servo exists");
		Delay(1000);
#endif

#if READ_TEST
		//读取ID1舵机的当前电流
    servo_read_present_current(1, order_buffer,&order_len);
    
		USART1_Send(order_buffer, order_len);
		
		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
		
    servo_read_present_current_analysis(receive_data, &analysis_data);
    PRINTF("present current is %d",analysis_data);
		
		Delay(1000);
#endif

#if READ_TEST
		//读取ID1舵机的当前位置
    servo_read_present_position(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_present_position_analysis(receive_data, &analysis_data);
    PRINTF("present position is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的当前速度
    servo_read_present_velocity(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_present_velocity_analysis(receive_data, &analysis_data);
    PRINTF("present velocity is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的当前的规划位置
    servo_read_present_profile_position(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_present_profile_position_analysis(receive_data, &analysis_data);
    PRINTF("present profile position is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的当前规划速度
    servo_read_present_profile_velocity(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_present_profile_velocity_analysis(receive_data, &analysis_data);
    PRINTF("present profile velocity is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的当前PWM
    servo_read_present_pwm(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_present_pwm_analysis(receive_data, &analysis_data);
    PRINTF("present pwm analysis is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的当前温度
    servo_read_present_temperature(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_present_temperature_analysis(receive_data, &analysis_data);
    PRINTF("present temperature is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的当前输入电压
    servo_read_present_voltage(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

