Janechel/test1/PrimaryMemoryTable/C/STM32F103C8T6/Example/User/main.c
    servo_read_present_voltage_analysis(receive_data, &analysis_data);
    PRINTF("present voltage is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的控时目标运行时间
    servo_read_time_base_target_moving_time(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_time_base_target_moving_time_analysis(receive_data, &analysis_data);
    PRINTF("present time base target moving time is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的控时目标位置
    servo_read_time_base_target_position(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_time_base_target_position_analysis(receive_data, &analysis_data);
    PRINTF("present time base target position is %d",analysis_data);
		
		Delay(1000);
#endif

#if READ_TEST
		//读取ID1舵机的控时加速度等级
    servo_read_time_base_target_acc(1, order_buffer,&order_len);   
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_time_base_target_acc_analysis(receive_data, &analysis_data);
    PRINTF("present time base target acc is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的控速目标减速度
    servo_read_velocity_base_target_dec(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
		
    servo_read_velocity_base_target_dec_analysis(receive_data, &analysis_data);
    PRINTF("present velocity base target dec is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的控速目标加速度
    servo_read_velocity_base_target_acc(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_velocity_base_target_acc_analysis(receive_data, &analysis_data);
    PRINTF("present velocity base target acc is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的控速目标速度
    servo_read_velocity_base_target_velocity(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_velocity_base_target_velocity_analysis(receive_data, &analysis_data);
    PRINTF("present velocity base target velocity is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的控速目标位置
    servo_read_velocity_base_target_position(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_velocity_base_target_position_analysis(receive_data, &analysis_data);
    PRINTF("present velocity base target position is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的目标电流
    servo_read_target_current(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_target_current_analysis(receive_data, &analysis_data);
    PRINTF("target current is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的目标PWM
    servo_read_target_pwm(1, order_buffer,&order_len);  
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_target_pwm_analysis(receive_data, &analysis_data);
    PRINTF("target pwm is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的扭矩开关
    servo_read_torque_switch(1, order_buffer,&order_len);  
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_torque_switch_analysis(receive_data, &analysis_data);
    PRINTF("torque switch is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的LED开关
    servo_read_led_switch(1, order_buffer,&order_len);   
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_led_switch_analysis(receive_data, &analysis_data);
    PRINTF("led switch is %d",analysis_data);
		
		Delay(1000);
#endif

#if READ_TEST
		//读取ID1舵机的Flash开关
    servo_read_flash_switch(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_flash_switch_analysis(receive_data, &analysis_data);
    PRINTF("flash switch is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的电流校正值
    servo_read_current_offset(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_current_offset_analysis(receive_data, &analysis_data);
    PRINTF("current offset is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的中位校正值
    servo_read_calibration(1, order_buffer,&order_len);  
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

