Janechel/test1/PrimaryMemoryTable/C/STM32F103C8T6/Example/User/main.c
    servo_read_calibration_analysis(receive_data, &analysis_data);
    PRINTF("calibration is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的控制模式
    servo_read_control_mode(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_control_mode_analysis(receive_data, &analysis_data);
    PRINTF("control mode is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的卸载保护条件
    servo_read_shutdown_condition(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_shutdown_condition_analysis(receive_data, &analysis_data);
    PRINTF("shutdown condition is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的LED报警条件
    servo_read_led_condition(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_led_condition_analysis(receive_data, &analysis_data);
    PRINTF("led condition is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的位置控制D增益
    servo_read_position_control_d_gain(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_position_control_d_gain_analysis(receive_data, &analysis_data);
    PRINTF("position control d gain is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的位置控制I增益
    servo_read_position_control_i_gain(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_position_control_i_gain_analysis(receive_data, &analysis_data);
    PRINTF("position control i gain is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的位置控制P增益
    servo_read_position_control_p_gain(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_position_control_p_gain_analysis(receive_data, &analysis_data);
    PRINTF("position control p gain is %d",analysis_data);
		
		Delay(1000);
#endif

#if READ_TEST
		//读取ID1舵机的PWM叠加值
    servo_read_pwm_punch(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_pwm_punch_analysis(receive_data, &analysis_data);
    PRINTF("pwm punch is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的反转死区
    servo_read_ccw_deadband(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_ccw_deadband_analysis(receive_data, &analysis_data);
    PRINTF("ccw deadband is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的正转死区
    servo_read_cw_deadband(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_cw_deadband_analysis(receive_data, &analysis_data);
    PRINTF("cw deadband is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的电流保护时间
    servo_read_current_shutdown_time(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_current_shutdown_time_analysis(receive_data, &analysis_data);
    PRINTF("current shutdown time is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的电流上限
    servo_read_max_current_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_max_current_limit_analysis(receive_data, &analysis_data);
    PRINTF("max current limit is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的PWM上限
    servo_read_max_pwm_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_max_pwm_limit_analysis(receive_data, &analysis_data);
    PRINTF("max pwm limit is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的电压上限
    servo_read_max_voltage_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_max_voltage_limit_analysis(receive_data, &analysis_data);
    PRINTF("max voltage limit is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的电压下限
    servo_read_min_voltage_limit(1, order_buffer,&order_len);   
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_min_voltage_limit_analysis(receive_data, &analysis_data);
    PRINTF("min voltage limit is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的温度上限
    servo_read_max_temperature_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
		
