Janechel/test1/PrimaryMemoryTable/C/STM32F103C8T6/Example/User/main.c
    servo_read_max_temperature_limit_analysis(receive_data, &analysis_data);
    PRINTF("max temperature limit is %d",analysis_data);
		
		Delay(1000);
#endif

#if READ_TEST
		//读取ID1舵机的最大位置限制
    servo_read_max_angle_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_max_angle_limit_analysis(receive_data, &analysis_data);
    PRINTF("max angle limit is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的最小位置限制
    servo_read_min_angle_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_min_angle_limit_analysis(receive_data, &analysis_data);
    PRINTF("min angle limit is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的状态返回级别
    servo_read_return_level(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_return_level_analysis(receive_data, &analysis_data);
    PRINTF("return level is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的应答延时时间
    servo_read_return_delay_time(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_return_delay_time_analysis(receive_data, &analysis_data);
    PRINTF("return delay time is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的波特率
    servo_read_baud_rate(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_baud_rate_analysis(receive_data, &analysis_data);
    PRINTF("baud rate is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的出厂编号
    servo_read_model_information(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_model_information_analysis(receive_data, &analysis_data);
    PRINTF("model information is %d",analysis_data);
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的固件版本号
    servo_read_firmware_version(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    servo_read_firmware_version_analysis(receive_data, &analysis_data);
    PRINTF("firmware version is %d",analysis_data);
		
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 0, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID1舵机的控制模式
    servo_set_control_mode(1, 1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_control_mode_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set control mode success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID2舵机的扭矩开关
    servo_set_torque_switch(2, 0, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID2舵机的控制模式
    servo_set_control_mode(2, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_control_mode_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set control mode success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID2舵机的扭矩开关
    servo_set_torque_switch(2, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif
	
#if SYNC_WRITE_TEST
		//设置多个舵机的控速目标速度
		
		//id为1，2的舵机速度分别设置为3600，1800，值和前面的id设置对应
    servo.velocity[0] = 3600;
    servo.velocity[1] = 1800;
		
		servo_sync_write_velocity_base_target_velocity(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置多个舵机的控速目标加速度
		
		//id为1，2的舵机加速度分别设置为150，150，值和前面的id设置对应
    servo.acc_velocity[0] = 150;          
    servo.acc_velocity[1] = 150;    
		
		servo_sync_write_velocity_base_target_acc(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置多个舵机的控速目标减速度
		
