Janechel/test1/PrimaryMemoryTable/C/STM32F103C8T6/Example/User/main.c
		//id为1，2的舵机减速度分别设置为150，150，值和前面的id设置对应
    servo.dec_velocity[0] = 150;           
    servo.dec_velocity[1] = 150;   
		
		servo_sync_write_velocity_base_target_dec(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置多个舵机的控速目标位置
		
		//id为1，2的舵机运动位置分别设置为0，0，值和前面的id设置对应
    servo.position[0] = 0;
    servo.position[1] = 0;
		
		servo_sync_write_velocity_base_target_position(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置多个舵机的控速目标位置和速度
		
		//id为1，2的舵机速度分别设置为1800，3600，位置分别设置为3000，3000
    servo.velocity[0] = 1800;
    servo.velocity[1] = 3600;
    servo.position[0] = 3000;
    servo.position[1] = 3000;
		
		servo_sync_write_velocity_base_target_position_and_velocity(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置多个舵机的加速度，减速度，速度和位置

    //id为1，2的舵机速度分别设置为3600，3600，位置分别设置为0，0,加速度分别设置为100，100，减速度分别设置为100，100
    servo.velocity[0] = 3600;
    servo.velocity[1] = 3600;
    servo.position[0] = 0;
    servo.position[1] = 0;
    servo.acc_velocity[0] = 100;
    servo.acc_velocity[1] = 100;
    servo.dec_velocity[0] = 100;
    servo.dec_velocity[1] = 100;

		servo_sync_write_velocity_base_target_acc_dec_velocity_and_position(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		
		Delay(1000);

#endif

#if SYNC_WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 0, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID1舵机的控制模式
    servo_set_control_mode(1, 0, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_control_mode_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set control mode success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID2舵机的扭矩开关
    servo_set_torque_switch(2, 0, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID2舵机的控制模式
    servo_set_control_mode(2, 0, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_control_mode_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set control mode success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置ID2舵机的扭矩开关
    servo_set_torque_switch(2, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置多个舵机的控时目标加速度等级
		
		//设置舵机id为1，2的加速度等级分别为0，0
    servo.acc_velocity_grade[0] = 0;
    servo.acc_velocity_grade[1] = 0;
		
    servo_sync_write_time_base_target_acc(servo, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//设置多个舵机的控时目标位置和运动时间
		
		//设置舵机id为1，2的运动位置为3000，3000，运动时间为500ms，1500ms
    servo.position[0] = 3000;
    servo.position[1] = 3000;
    servo.time[0] = 500;
    servo.time[1] = 1500;
		
		servo_sync_write_time_base_target_position_and_moving_time(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的状态返回级别
    servo_set_return_level(1, 2, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_return_level_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set return level success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的应答延时时间
		servo_set_return_delay_time(1, 250,order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_return_delay_time_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set return delay time success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的波特率
    servo_set_baud_rate(1, 7, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_baud_rate_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set baud rate success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的最小位置限制
    servo_set_min_angle_limit(1, 0, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_min_angle_limit_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set min angle limit success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的最大位置限制
    servo_set_max_angle_limit(1, 3000, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

