Janechel/test1/PrimaryMemoryTable/C/STM32F103C8T6/Example/User/main.c
    ret = servo_set_max_angle_limit_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set max angle limit success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的温度上限
    servo_set_max_temperature_limit(1, 100, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_max_temperature_limit_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set max temperature limit success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的电压上限
    servo_set_max_voltage_limit(1,90, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_max_voltage_limit_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set max voltage limit success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的电压下限
    servo_set_min_voltage_limit(1, 33, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_min_voltage_limit_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set min voltage limit success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的PWM上限
    servo_set_max_pwm_limit(1, 1000, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_max_pwm_limit_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set max pwm limit success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的电流上限
    servo_set_max_current_limit(1, 400, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_max_current_limit_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set max current limit success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的电流保护时间
    servo_set_current_shutdown_time(1, 1000, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_current_shutdown_time_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set current shutdown time success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的正转死区
    servo_set_cw_deadband(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_cw_deadband_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set cw deadband success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的反转死区
    servo_set_ccw_deadband(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_ccw_deadband_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set ccw deadband success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的PWM叠加值
    servo_set_pwm_punch(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_pwm_punch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set pwm punch success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的位置控制P增益
    servo_set_position_control_p_gain(1, 6000, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_position_control_p_gain_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set position control p gain success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的位置控制I增益
    servo_set_position_control_i_gain(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_position_control_i_gain_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set position control i gain success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的位置控制D增益
    servo_set_position_control_d_gain(1, 151, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_position_control_d_gain_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set position control d gain success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的LED报警条件
    servo_set_led_condition(1, 36, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_led_condition_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set led condition success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的卸载保护条件
    servo_set_shutdown_conditions(1, 36, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

