Janechel/test1/PrimaryMemoryTable/C/STM32F103C8T6/Example/User/main.c
    ret = servo_set_shutdown_conditions_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set shutdown conditions success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的Flash开关
    servo_set_flash_switch(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_flash_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set flash switch success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的LED开关
    servo_set_led_switch(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_led_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set led switch success");
		Delay(1000);
#endif
		
#if WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 0, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的控制模式
    servo_set_control_mode(1, 3, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_control_mode_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set control mode success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的目标PWM
    servo_set_target_pwm(1, 1000, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_target_pwm_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set target pwm success");
		Delay(3000);
#endif
		
		#if WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 0, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的控制模式
    servo_set_control_mode(1, 2, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_control_mode_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set control mode success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的目标电流
    servo_set_target_current(1, -1000, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_target_current_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set target current success");
		Delay(3000);
#endif
		
#if WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 0, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的控制模式
    servo_set_control_mode(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_control_mode_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set control mode success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的扭矩开关
    servo_set_torque_switch(1, 1, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_torque_switch_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set torque switch success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的控速目标速度
    servo_set_velocity_base_target_velocity(1, 3600, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = servo_set_velocity_base_target_velocity_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("servo set velocity base target velocity success");
		Delay(1000);
#endif

#if WRITE_TEST
		//设置ID1舵机的控速目标加速度
    servo_set_velocity_base_target_acc(1, 150, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

